all_city_data = {'Astana': 71,'Almata' : 75,'Shymkent' : 79,'Akmola_reg' : 11
    ,'Aktobe_reg' : 15,'Almaata_reg' : 19,'Atyrau_reg' : 23,'East_Kz_reg' : 63
    ,'Jambyl_reg' : 31,'West_Kz_reg' : 27, 'Karaganda_reg' : 35,'Kostanay' : 39
    ,'Kyzylorda_reg' : 43,'Mangistau_reg' : 47,'Abay_reg' : 10,'Zhetysu_reg' : 33
    ,'Ulytau_reg' : 62,'Pavlodar_reg' : 55,'North_Kz_reg' : 59,'Turkestan_reg' : 61}

all_prof_data = ['Машинист','Менеджер','Аналитик','Дизайнер','Програмист','Оператор','Мастер'
    ,'Автомеханик','Администратор','Косметолог','Мастер декоративных работ'
    ,'Метролог','Оптик-механик','Парикмахер','Строитель','Разнорабочий','Повар','Кондитер'
    ,'Сантехник','Сварщик','Слесарь','Специалист','Техник','Учитель',"Тренер","Санитар","Врач","Бухгалтер",
    "Агроном","Психолог","Швея","Кассир","Мойщик","Уборщик","Дворник","Инженер","Рекламный агент","IT","Секретарь","Ведущий специалист",
    "Юрист","Адвокат"
    ]

all_city_data_hh = {'Astana': 159,'Almata' : 160,'Shymkent' : 205
    ,'Aktobe_reg' : 154,'Almaata_reg' : 6358,'Atyrau_reg' : 153
    , 'Karaganda_reg' : 177,'Kostanay' : 172
    ,'Kyzylorda_reg' : 174,'Mangistau_reg' : 6244,'Abay_reg' : 6251
    ,'Pavlodar_reg' : 181,'Turkestan_reg' : 192}

data = {'Машинист': [], 'Менеджер': [], 'Аналитик': [], 'Дизайнер': [], 'Програмист': [], 'Оператор': [],'Мастер': []
    , 'Автомеханик': [], 'Администратор': [], 'Косметолог': [], 'Мастер декоративных работ': []
    , 'Метролог': [], 'Оптик-механик': [], 'Парикмахер': [], 'Строитель': [], 'Разнорабочий': [], 'Повар': [],'Кондитер': []
    , 'Сантехник': [], 'Сварщик': [], 'Слесарь': [], 'Специалист': [], 'Техник': [],
    "Учитель" : [], "Тренер" : [], "Санитар" : [], "Врач" : [], "Бухгалтер" : [], "Агроном" : [],
    "Психолог" : [], "Швея" : [], "Кассир" : [], "Мойщик" : [], "Уборщик" : [], "Дворник" : [],
    "Инженер" : [], "Рекламный агент" : [], "IT" : [], "Секретарь" : [], "Ведущий специалист" : [],
    "Юрист" : [],"Адвокат" : []    
    }

headers = {"Accept" : "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8",
                "User-Agent" : "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36"}